{
    "personal": [
        {
            "id": 1,
            "title": "damitzi.com",
            "description": "My personal portfolio website built with Astro, showcasing my projects, experience, skills, and favorite hobbies. Features a modern design with dark mode support and responsive layout.",
            "link": "https://damitzi.com",
            "githubUrl": "https://github.com/damtzi/damitzi.com",
            "tech": [
                "Astro",
                "Tailwind CSS",
                "TypeScript",
                "React",
                "Cloudflare",
                "pnpm"
            ]
        }
    ],
    "work": [
        {
            "id": 2,
            "title": "iLancaster",
            "description": "Official mobile app for Lancaster University with 10K+ downloads. Built with React Native, providing students access to university services, resources, library information, and campus navigation. Features live streaming, timetables, and integration with the student portal.",
            "link": "https://portal.lancaster.ac.uk/ask/mobile/",
            "tech": [
                "React Native",
                "React",
                "Redux",
                "TypeScript",
                "styled components",
                "Azure"
            ]
        },
        {
            "id": 3,
            "title": "Secretarium Website",
            "description": "Corporate website for Secretarium, a UK confidential computing leader. Built with React and Next.js, showcasing their innovative privacy-preserving technology, Trusted Execution Environments (TEEs), and solutions for secure data processing across financial services and healthcare.",
            "link": "https://secretarium.com",
            "tech": [
                "React",
                "Next.js",
                "TypeScript",
                "Tailwind CSS",
                "yarn",
                "NX",
                "motion",
                "Docker",
                "Payload CMS"
            ]
        },
        {
            "id": 4,
            "title": "Moai Website",
            "description": "Marketing website for Moai, a privacy-preserving COVID-19 contact tracing and immunity certificate app. Built during the pandemic to enable secure track and trace without collecting personal data, supporting cross-border collaboration and anonymous venue check-ins.",
            "link": "https://moaiapp.com",
            "tech": [
                "React",
                "Next.js",
                "TypeScript",
                "Tailwind CSS",
                "yarn",
                "NX",
                "motion",
                "Docker",
                "Payload CMS"
            ]
        },
        {
            "id": 5,
            "title": "Moai App",
            "description": "Privacy-first mobile application (iOS & Android) for COVID-19 contact tracing and exposure risk assessment. Developed with React Native, featuring anonymous QR code scanning, secure location check-ins, and immunity certificate sharing without compromising user privacy.",
            "link": "https://moaiapp.com",
            "tech": [
                "React Native",
                "Expo",
                "styled components",
                "Node.js",
                "TypeScript",
                "yarn"
            ]
        },
        {
            "id": 6,
            "title": "STTS Website",
            "description": "Website for the Secretarium Tokenisation & Trading Suite. Showcases the secure platform for tokenising and trading assets using confidential computing, featuring delivery vs payment processes, parametric tokens, and immutable audit trails powered by TEEs.",
            "link": "https://stts.io",
            "tech": [
                "React",
                "Next.js",
                "TypeScript",
                "Tailwind CSS",
                "yarn",
                "NX",
                "motion",
                "Docker"
            ]
        },
        {
            "id": 7,
            "title": "DANIE Website",
            "description": "Platform website for DANIE, a consortium of financial institutions using Privacy-Enhancing Technology for secure cross-firm collaboration. Multiple A-Team Innovation Awards winner for enabling KYC, AML, and reference data reconciliation without exposing sensitive information.",
            "link": "https://danie.tech",
            "tech": [
                "React",
                "Next.js",
                "TypeScript",
                "Tailwind CSS",
                "yarn",
                "NX",
                "motion",
                "Docker"
            ]
        },
        {
            "id": 8,
            "title": "Amlytic Website",
            "description": "Marketing site for Amlytic, an award-winning anti-money laundering platform. Won the BIS/G20 TechSprint on cross-border AML/CFT collaboration. Features privacy-preserving transaction data pooling enabling financial institutions to detect money laundering patterns at scale.",
            "link": "https://amlytic.com",
            "tech": [
                "React",
                "Next.js",
                "TypeScript",
                "Tailwind CSS",
                "yarn",
                "NX",
                "motion",
                "Docker"
            ]
        },
        {
            "id": 9,
            "title": "SoftMetal Website",
            "description": "Corporate website for SoftMetal AG, a metal trading company using confidential computing for blind FerroChrome auctions. Built with modern web technologies to showcase their innovative trading platform powered by Secretarium technology.",
            "link": "https://softmetal.ch",
            "tech": [
                "React",
                "Next.js",
                "TypeScript",
                "Tailwind CSS",
                "yarn",
                "NX",
                "motion",
                "Docker",
                "Payload CMS"
            ]
        },
        {
            "id": 10,
            "title": "SoftMetal Platform",
            "description": "Secure trading platform enabling blind auctions for FerroChrome and metals. Built on confidential computing with React, featuring parametric token trading, custodian integration, and tamper-proof execution. Enables flexible trading beyond traditional exchange standards.",
            "link": "https://app.softmetal.ch",
            "tech": [
                "React",
                "SPA",
                "TypeScript",
                "Tailwind CSS",
                "NX",
                "yarn",
                "React Router",
                "Redux",
                "Docker"
            ]
        },
        {
            "id": 11,
            "title": "Klave Website",
            "description": "Marketing website for Klave, Secretarium's flagship confidential computing Platform-as-a-Service. Built with Next.js and Tailwind CSS, showcasing the serverless platform that enables developers to deploy WebAssembly apps into secure TEEs with end-to-end encryption.",
            "link": "https://klave.com",
            "tech": [
                "React",
                "Next.js",
                "TypeScript",
                "Tailwind CSS",
                "yarn",
                "NX",
                "motion",
                "Docker",
                "Payload CMS"
            ]
        },
        {
            "id": 12,
            "title": "Klave Platform",
            "description": "Full-stack confidential computing PaaS built with React and Node.js. Enables developers to deploy WebAssembly applications into Trusted Execution Environments with cryptographic attestation, secure ledger storage, and lightning-fast performance without cold starts.",
            "link": "https://app.klave.com",
            "githubUrl": "https://github.com/klave-network/platform",
            "tech": [
                "React",
                "SPA",
                "Node.js",
                "TypeScript",
                "Fastify",
                "Tailwind CSS",
                "NX",
                "yarn",
                "React Router",
                "Redux",
                "MongoDB",
                "Prisma",
                "Docker"
            ]
        },
        {
            "id": 13,
            "title": "Klave CLI",
            "description": "Command-line interface tool for Klave platform built with Rust. Provides developers seamless workflow integration to scaffold, build, deploy, and manage confidential computing applications directly from the terminal.",
            "link": "https://klave.com",
            "githubUrl": "https://github.com/klave-network/cli",
            "tech": ["Node.js", "TypeScript", "Rust"]
        },
        {
            "id": 14,
            "title": "Klave Docs",
            "description": "Comprehensive documentation site for Klave platform built with Next.js and MDX. Features quickstart guides, SDK references, architecture deep-dives, and tutorials for building trustless WebAssembly applications with confidential computing in AssemblyScript and Rust.",
            "link": "https://docs.klave.com",
            "githubUrl": "https://github.com/klave-network/docs",
            "tech": [
                "React",
                "Next.js",
                "TypeScript",
                "Tailwind CSS",
                "yarn",
                "NX",
                "motion",
                "MDX",
                "Markdown",
                "Fumadocs",
                "Docker"
            ]
        },
        {
            "id": 15,
            "title": "Klave AI",
            "description": "Confidential AI solution enabling secure RAG and inference. Built on TEEs to keep models, prompts, and data encrypted by default. Features data provenance tracking, model lineage, and cryptographic guarantees for enterprise AI workflows.",
            "link": "https://klave.com/confidential-ai",
            "tech": [
                "React",
                "SPA",
                "Node.js",
                "TypeScript",
                "Fastify",
                "Tailwind CSS",
                "NX",
                "yarn",
                "TanStack Router",
                "Zustand",
                "Docker"
            ]
        }
    ]
}
